artillery/login-test.yml
config:
  plugin:
    statsd:
      host: "localhost"
      port: 8125
      prefix: "artillery"
  target: https://credit-card.ibmdeveloper.net
  processor: "./custom-artillery-functions.js"
  phases:
    - duration: 1
      arrivalRate: 1
      rampTo: 1
      name: "Login warmup"
    - duration: 100
      arrivalRate: 3
      name: "Login max load"
scenarios:
  - name: "Login testing"
    flow:
      - function: "getUser"
      - log: "The username is: {{ username }}"
      - post:
          url: "/demo/login"
          json:
            username: "{{ username }}"
            password: "{{ username }}"
          capture:
            json: "$"
            as: "error"
      - log: "The response is: {{ error }}"            

scenarios:
  - name: "Login testing"
    flow:
      - function: "getUser"
      - log: "The username is: {{ username }}"
      - post:
          url: "/demo/login"
          json:
            username: "{{ username }}"
            password: "{{ username }}"
          capture:
            json: "$"
            as: "error"
      - log: "The response is: {{ error }}"