artillery/login-test.yml
config:
  plugin:
    statsd:
      host: "localhost"
      port: 8125
      prefix: "artillery"
  target: https://credit-card.ibmdeveloper.net
  processor: "./custom-artillery-functions.js"
  phases:
    - duration: 1
      arrivalRate: 1
      rampTo: 1
      name: "Login warmup"
scenarios:
  - name: "Get user and login"
    flow:
      - get:
          url: "/demo/get_all_users"
          afterResponse: "afterGetUsers"
      - log: "The username picked is {{ user }}"
      - post:
          url: "/demo/login"
          headers:
            Content-type: "application/json"
          json:
            username: "{{ user }}"
            password: "{{ user }}"
          capture:
            json: "$.access_token"
            as: "token"
      - log: "Got this token {{ token }}"
      - post:
          url: "/proxy_transaction/bank/v1/transactions"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            category: "CAFE"
            transactionName: "ArtilleryCoffee"
            amount: "109"
      - get:
          url: "/proxy_transaction/bank/v1/transactions"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            json: "$"
            as: "transactions"
      - log: "The transactions are: {{ transactions }}"